balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F8490.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="LCDSE1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDSE1" edc:desc="" edc:mask="0xff" edc:name="LCDSE1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SE8" edc:desc="" edc:mask="0x1" edc:name="SE8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE9" edc:desc="" edc:mask="0x1" edc:name="SE9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE10" edc:desc="" edc:mask="0x1" edc:name="SE10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE11" edc:desc="" edc:mask="0x1" edc:name="SE11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE12" edc:desc="" edc:mask="0x1" edc:name="SE12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE13" edc:desc="" edc:mask="0x1" edc:name="SE13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE14" edc:desc="" edc:mask="0x1" edc:name="SE14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE15" edc:desc="" edc:mask="0x1" edc:name="SE15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEGEN8" edc:desc="" edc:mask="0x1" edc:name="SEGEN8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN9" edc:desc="" edc:mask="0x1" edc:name="SEGEN9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN10" edc:desc="" edc:mask="0x1" edc:name="SEGEN10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN11" edc:desc="" edc:mask="0x1" edc:name="SEGEN11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN12" edc:desc="" edc:mask="0x1" edc:name="SEGEN12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN13" edc:desc="" edc:mask="0x1" edc:name="SEGEN13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN14" edc:desc="" edc:mask="0x1" edc:name="SEGEN14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN15" edc:desc="" edc:mask="0x1" edc:name="SEGEN15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="LCDSE2" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDSE2" edc:desc="" edc:mask="0xff" edc:name="LCDSE2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SE16" edc:desc="" edc:mask="0x1" edc:name="SE16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE17" edc:desc="" edc:mask="0x1" edc:name="SE17" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE18" edc:desc="" edc:mask="0x1" edc:name="SE18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE19" edc:desc="" edc:mask="0x1" edc:name="SE19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE20" edc:desc="" edc:mask="0x1" edc:name="SE20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE21" edc:desc="" edc:mask="0x1" edc:name="SE21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE22" edc:desc="" edc:mask="0x1" edc:name="SE22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE23" edc:desc="" edc:mask="0x1" edc:name="SE23" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEGEN16" edc:desc="" edc:mask="0x1" edc:name="SEGEN16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN17" edc:desc="" edc:mask="0x1" edc:name="SEGEN17" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN18" edc:desc="" edc:mask="0x1" edc:name="SEGEN18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN19" edc:desc="" edc:mask="0x1" edc:name="SEGEN19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN20" edc:desc="" edc:mask="0x1" edc:name="SEGEN20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN21" edc:desc="" edc:mask="0x1" edc:name="SEGEN21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN22" edc:desc="" edc:mask="0x1" edc:name="SEGEN22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN23" edc:desc="" edc:mask="0x1" edc:name="SEGEN23" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="LCDSE3" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDSE3" edc:desc="" edc:mask="0xff" edc:name="LCDSE3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SE24" edc:desc="" edc:mask="0x1" edc:name="SE24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE25" edc:desc="" edc:mask="0x1" edc:name="SE25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE26" edc:desc="" edc:mask="0x1" edc:name="SE26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE27" edc:desc="" edc:mask="0x1" edc:name="SE27" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE28" edc:desc="" edc:mask="0x1" edc:name="SE28" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE29" edc:desc="" edc:mask="0x1" edc:name="SE29" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE30" edc:desc="" edc:mask="0x1" edc:name="SE30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE31" edc:desc="" edc:mask="0x1" edc:name="SE31" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEGEN24" edc:desc="" edc:mask="0x1" edc:name="SEGEN24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN25" edc:desc="" edc:mask="0x1" edc:name="SEGEN25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN26" edc:desc="" edc:mask="0x1" edc:name="SEGEN26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN27" edc:desc="" edc:mask="0x1" edc:name="SEGEN27" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN28" edc:desc="" edc:mask="0x1" edc:name="SEGEN28" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN29" edc:desc="" edc:mask="0x1" edc:name="SEGEN29" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN30" edc:desc="" edc:mask="0x1" edc:name="SEGEN30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN31" edc:desc="" edc:mask="0x1" edc:name="SEGEN31" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
