balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F8490.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="LCDSE4" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDSE4" edc:desc="" edc:mask="0xff" edc:name="LCDSE4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SE32" edc:desc="" edc:mask="0x1" edc:name="SE32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE33" edc:desc="" edc:mask="0x1" edc:name="SE33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE34" edc:desc="" edc:mask="0x1" edc:name="SE34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE35" edc:desc="" edc:mask="0x1" edc:name="SE35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE36" edc:desc="" edc:mask="0x1" edc:name="SE36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE37" edc:desc="" edc:mask="0x1" edc:name="SE37" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE38" edc:desc="" edc:mask="0x1" edc:name="SE38" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE39" edc:desc="" edc:mask="0x1" edc:name="SE39" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEGEN32" edc:desc="" edc:mask="0x1" edc:name="SEGEN32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN33" edc:desc="" edc:mask="0x1" edc:name="SEGEN33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN34" edc:desc="" edc:mask="0x1" edc:name="SEGEN34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN35" edc:desc="" edc:mask="0x1" edc:name="SEGEN35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN36" edc:desc="" edc:mask="0x1" edc:name="SEGEN36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN37" edc:desc="" edc:mask="0x1" edc:name="SEGEN37" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN38" edc:desc="" edc:mask="0x1" edc:name="SEGEN38" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN39" edc:desc="" edc:mask="0x1" edc:name="SEGEN39" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="LCDSE5" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDSE5" edc:desc="" edc:mask="0xff" edc:name="LCDSE5" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SE40" edc:desc="" edc:mask="0x1" edc:name="SE40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE41" edc:desc="" edc:mask="0x1" edc:name="SE41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE42" edc:desc="" edc:mask="0x1" edc:name="SE42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE43" edc:desc="" edc:mask="0x1" edc:name="SE43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE44" edc:desc="" edc:mask="0x1" edc:name="SE44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE45" edc:desc="" edc:mask="0x1" edc:name="SE45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE46" edc:desc="" edc:mask="0x1" edc:name="SE46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE47" edc:desc="" edc:mask="0x1" edc:name="SE47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEGEN40" edc:desc="" edc:mask="0x1" edc:name="SEGEN40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN41" edc:desc="" edc:mask="0x1" edc:name="SEGEN41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN42" edc:desc="" edc:mask="0x1" edc:name="SEGEN42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN43" edc:desc="" edc:mask="0x1" edc:name="SEGEN43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN44" edc:desc="" edc:mask="0x1" edc:name="SEGEN44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN45" edc:desc="" edc:mask="0x1" edc:name="SEGEN45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN46" edc:desc="" edc:mask="0x1" edc:name="SEGEN46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN47" edc:desc="" edc:mask="0x1" edc:name="SEGEN47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0xf" edc:beginaddr="0xf60" edc:endaddr="0x1000" edc:regionid="accesssfr">
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA0" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA0" edc:desc="" edc:mask="0xff" edc:name="LCDDATA0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S0C0" edc:desc="" edc:mask="0x1" edc:name="S0C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S1C0" edc:desc="" edc:mask="0x1" edc:name="S1C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S2C0" edc:desc="" edc:mask="0x1" edc:name="S2C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S3C0" edc:desc="" edc:mask="0x1" edc:name="S3C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S4C0" edc:desc="" edc:mask="0x1" edc:name="S4C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S5C0" edc:desc="" edc:mask="0x1" edc:name="S5C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S6C0" edc:desc="" edc:mask="0x1" edc:name="S6C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S7C0" edc:desc="" edc:mask="0x1" edc:name="S7C0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG0COM0" edc:desc="" edc:mask="0x1" edc:name="SEG0COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG1COM0" edc:desc="" edc:mask="0x1" edc:name="SEG1COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2COM0" edc:desc="" edc:mask="0x1" edc:name="SEG2COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG3COM0" edc:desc="" edc:mask="0x1" edc:name="SEG3COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG4COM0" edc:desc="" edc:mask="0x1" edc:name="SEG4COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG5COM0" edc:desc="" edc:mask="0x1" edc:name="SEG5COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG6COM0" edc:desc="" edc:mask="0x1" edc:name="SEG6COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG7COM0" edc:desc="" edc:mask="0x1" edc:name="SEG7COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S00C0" edc:desc="" edc:mask="0x1" edc:name="S00C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S01C0" edc:desc="" edc:mask="0x1" edc:name="S01C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S02C0" edc:desc="" edc:mask="0x1" edc:name="S02C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S03C0" edc:desc="" edc:mask="0x1" edc:name="S03C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S04C0" edc:desc="" edc:mask="0x1" edc:name="S04C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S05C0" edc:desc="" edc:mask="0x1" edc:name="S05C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S06C0" edc:desc="" edc:mask="0x1" edc:name="S06C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S07C0" edc:desc="" edc:mask="0x1" edc:name="S07C0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA1" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA1" edc:desc="" edc:mask="0xff" edc:name="LCDDATA1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S8C0" edc:desc="" edc:mask="0x1" edc:name="S8C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S9C0" edc:desc="" edc:mask="0x1" edc:name="S9C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S10C0" edc:desc="" edc:mask="0x1" edc:name="S10C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S11C0" edc:desc="" edc:mask="0x1" edc:name="S11C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S12C0" edc:desc="" edc:mask="0x1" edc:name="S12C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S13C0" edc:desc="" edc:mask="0x1" edc:name="S13C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S14C0" edc:desc="" edc:mask="0x1" edc:name="S14C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S15C0" edc:desc="" edc:mask="0x1" edc:name="S15C0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG8COM0" edc:desc="" edc:mask="0x1" edc:name="SEG8COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG9COM0" edc:desc="" edc:mask="0x1" edc:name="SEG9COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG10COM0" edc:desc="" edc:mask="0x1" edc:name="SEG10COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG11COM0" edc:desc="" edc:mask="0x1" edc:name="SEG11COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG12COM0" edc:desc="" edc:mask="0x1" edc:name="SEG12COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG13COM0" edc:desc="" edc:mask="0x1" edc:name="SEG13COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG14COM0" edc:desc="" edc:mask="0x1" edc:name="SEG14COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG15COM0" edc:desc="" edc:mask="0x1" edc:name="SEG15COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S08C0" edc:desc="" edc:mask="0x1" edc:name="S08C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S09C0" edc:desc="" edc:mask="0x1" edc:name="S09C0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA2" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA2" edc:desc="" edc:mask="0xff" edc:name="LCDDATA2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S16C0" edc:desc="" edc:mask="0x1" edc:name="S16C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S17C0" edc:desc="" edc:mask="0x1" edc:name="S17C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S18C0" edc:desc="" edc:mask="0x1" edc:name="S18C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S19C0" edc:desc="" edc:mask="0x1" edc:name="S19C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S20C0" edc:desc="" edc:mask="0x1" edc:name="S20C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S21C0" edc:desc="" edc:mask="0x1" edc:name="S21C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S22C0" edc:desc="" edc:mask="0x1" edc:name="S22C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S23C0" edc:desc="" edc:mask="0x1" edc:name="S23C0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG16COM0" edc:desc="" edc:mask="0x1" edc:name="SEG16COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG17COM0" edc:desc="" edc:mask="0x1" edc:name="SEG17COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG18COM0" edc:desc="" edc:mask="0x1" edc:name="SEG18COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG19COM0" edc:desc="" edc:mask="0x1" edc:name="SEG19COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG20COM0" edc:desc="" edc:mask="0x1" edc:name="SEG20COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG21COM0" edc:desc="" edc:mask="0x1" edc:name="SEG21COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG22COM0" edc:desc="" edc:mask="0x1" edc:name="SEG22COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG23COM0" edc:desc="" edc:mask="0x1" edc:name="SEG23COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA3" edc:desc="" edc:mask="0xff" edc:name="LCDDATA3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S24C0" edc:desc="" edc:mask="0x1" edc:name="S24C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S25C0" edc:desc="" edc:mask="0x1" edc:name="S25C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S26C0" edc:desc="" edc:mask="0x1" edc:name="S26C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S27C0" edc:desc="" edc:mask="0x1" edc:name="S27C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S28C0" edc:desc="" edc:mask="0x1" edc:name="S28C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S29C0" edc:desc="" edc:mask="0x1" edc:name="S29C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S30C0" edc:desc="" edc:mask="0x1" edc:name="S30C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S31C0" edc:desc="" edc:mask="0x1" edc:name="S31C0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG24COM0" edc:desc="" edc:mask="0x1" edc:name="SEG24COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG25COM0" edc:desc="" edc:mask="0x1" edc:name="SEG25COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG26COM0" edc:desc="" edc:mask="0x1" edc:name="SEG26COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG27COM0" edc:desc="" edc:mask="0x1" edc:name="SEG27COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG28COM0" edc:desc="" edc:mask="0x1" edc:name="SEG28COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG29COM0" edc:desc="" edc:mask="0x1" edc:name="SEG29COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG30COM0" edc:desc="" edc:mask="0x1" edc:name="SEG30COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG31COM0" edc:desc="" edc:mask="0x1" edc:name="SEG31COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA4" edc:desc="" edc:mask="0xff" edc:name="LCDDATA4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S32C0" edc:desc="" edc:mask="0x1" edc:name="S32C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S33C0" edc:desc="" edc:mask="0x1" edc:name="S33C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S34C0" edc:desc="" edc:mask="0x1" edc:name="S34C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S35C0" edc:desc="" edc:mask="0x1" edc:name="S35C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S36C0" edc:desc="" edc:mask="0x1" edc:name="S36C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S37C0" edc:desc="" edc:mask="0x1" edc:name="S37C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S38C0" edc:desc="" edc:mask="0x1" edc:name="S38C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S39C0" edc:desc="" edc:mask="0x1" edc:name="S39C0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG32COM0" edc:desc="" edc:mask="0x1" edc:name="SEG32COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG33COM0" edc:desc="" edc:mask="0x1" edc:name="SEG33COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG34COM0" edc:desc="" edc:mask="0x1" edc:name="SEG34COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG35COM0" edc:desc="" edc:mask="0x1" edc:name="SEG35COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG36COM0" edc:desc="" edc:mask="0x1" edc:name="SEG36COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG37COM0" edc:desc="" edc:mask="0x1" edc:name="SEG37COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG38COM0" edc:desc="" edc:mask="0x1" edc:name="SEG38COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG39COM0" edc:desc="" edc:mask="0x1" edc:name="SEG39COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA5" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA5" edc:desc="" edc:mask="0xff" edc:name="LCDDATA5" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S40C0" edc:desc="" edc:mask="0x1" edc:name="S40C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S41C0" edc:desc="" edc:mask="0x1" edc:name="S41C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S42C0" edc:desc="" edc:mask="0x1" edc:name="S42C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S43C0" edc:desc="" edc:mask="0x1" edc:name="S43C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S44C0" edc:desc="" edc:mask="0x1" edc:name="S44C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S45C0" edc:desc="" edc:mask="0x1" edc:name="S45C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S46C0" edc:desc="" edc:mask="0x1" edc:name="S46C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S47C0" edc:desc="" edc:mask="0x1" edc:name="S47C0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG40COM0" edc:desc="" edc:mask="0x1" edc:name="SEG40COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG41COM0" edc:desc="" edc:mask="0x1" edc:name="SEG41COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG42COM0" edc:desc="" edc:mask="0x1" edc:name="SEG42COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG43COM0" edc:desc="" edc:mask="0x1" edc:name="SEG43COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG44COM0" edc:desc="" edc:mask="0x1" edc:name="SEG44COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG45COM0" edc:desc="" edc:mask="0x1" edc:name="SEG45COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG46COM0" edc:desc="" edc:mask="0x1" edc:name="SEG46COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG47COM0" edc:desc="" edc:mask="0x1" edc:name="SEG47COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
