balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F8490.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA10" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA10" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA10" edc:desc="" edc:mask="0xff" edc:name="LCDDATA10" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S32C1" edc:desc="" edc:mask="0x1" edc:name="S32C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S33C1" edc:desc="" edc:mask="0x1" edc:name="S33C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S34C1" edc:desc="" edc:mask="0x1" edc:name="S34C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S35C1" edc:desc="" edc:mask="0x1" edc:name="S35C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S36C1" edc:desc="" edc:mask="0x1" edc:name="S36C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S37C1" edc:desc="" edc:mask="0x1" edc:name="S37C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S38C1" edc:desc="" edc:mask="0x1" edc:name="S38C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S39C1" edc:desc="" edc:mask="0x1" edc:name="S39C1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG32COM1" edc:desc="" edc:mask="0x1" edc:name="SEG32COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG33COM1" edc:desc="" edc:mask="0x1" edc:name="SEG33COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG34COM1" edc:desc="" edc:mask="0x1" edc:name="SEG34COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG35COM1" edc:desc="" edc:mask="0x1" edc:name="SEG35COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG36COM1" edc:desc="" edc:mask="0x1" edc:name="SEG36COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG37COM1" edc:desc="" edc:mask="0x1" edc:name="SEG37COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG38COM1" edc:desc="" edc:mask="0x1" edc:name="SEG38COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG39COM1" edc:desc="" edc:mask="0x1" edc:name="SEG39COM1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrrr" edc:cname="RCSTA2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000x" edc:name="RCSTA2" edc:nzwidth="0x8" edc:por="0000000x">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX9D" edc:desc="" edc:mask="0x1" edc:name="RX9D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN" edc:desc="" edc:mask="0x1" edc:name="CREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN" edc:desc="" edc:mask="0x1" edc:name="SREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX9" edc:desc="" edc:mask="0x1" edc:name="RX9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN" edc:desc="" edc:mask="0x1" edc:name="SPEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RCD8" edc:desc="" edc:mask="0x1" edc:name="RCD8" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ADEN" edc:desc="" edc:mask="0x1" edc:name="ADEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RC9" edc:desc="" edc:mask="0x1" edc:name="RC9" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="nRC8" edc:desc="" edc:mask="0x1" edc:name="nRC8" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="RC8_9" edc:desc="" edc:mask="0x1" edc:name="RC8_9" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="RX9D2" edc:desc="" edc:mask="0x1" edc:name="RX9D2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR2" edc:desc="" edc:mask="0x1" edc:name="OERR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR2" edc:desc="" edc:mask="0x1" edc:name="FERR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN2" edc:desc="" edc:mask="0x1" edc:name="ADDEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN2" edc:desc="" edc:mask="0x1" edc:name="CREN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN2" edc:desc="" edc:mask="0x1" edc:name="SREN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX92" edc:desc="" edc:mask="0x1" edc:name="RX92" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN2" edc:desc="" edc:mask="0x1" edc:name="SPEN2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nrn" edc:cname="TXSTA2" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-010" edc:name="TXSTA2" edc:nzwidth="0x8" edc:por="0000-010">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX9D" edc:desc="" edc:mask="0x1" edc:name="TX9D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0x1" edc:name="BRGH" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX9" edc:desc="" edc:mask="0x1" edc:name="TX9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSRC" edc:desc="" edc:mask="0x1" edc:name="CSRC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXD8" edc:desc="" edc:mask="0x1" edc:name="TXD8" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="TX8_9" edc:desc="" edc:mask="0x1" edc:name="TX8_9" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="nTX8" edc:desc="" edc:mask="0x1" edc:name="nTX8" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="TX9D2" edc:desc="" edc:mask="0x1" edc:name="TX9D2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRMT2" edc:desc="" edc:mask="0x1" edc:name="TRMT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRGH2" edc:desc="" edc:mask="0x1" edc:name="BRGH2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SENDB2" edc:desc="" edc:mask="0x1" edc:name="SENDB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNC2" edc:desc="" edc:mask="0x1" edc:name="SYNC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN2" edc:desc="" edc:mask="0x1" edc:name="TXEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX92" edc:desc="" edc:mask="0x1" edc:name="TX92" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSRC2" edc:desc="" edc:mask="0x1" edc:name="CSRC2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="TXREG2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TXREG2" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXREG2" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXREG2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RCREG2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RCREG2" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RCREG2" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="RCREG2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="rp" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
