balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F8490.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA22" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA22" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA22" edc:desc="" edc:mask="0xff" edc:name="LCDDATA22" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S32C3" edc:desc="" edc:mask="0x1" edc:name="S32C3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S33C3" edc:desc="" edc:mask="0x1" edc:name="S33C3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S34C3" edc:desc="" edc:mask="0x1" edc:name="S34C3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S35C3" edc:desc="" edc:mask="0x1" edc:name="S35C3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S36C3" edc:desc="" edc:mask="0x1" edc:name="S36C3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S37C3" edc:desc="" edc:mask="0x1" edc:name="S37C3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S38C3" edc:desc="" edc:mask="0x1" edc:name="S38C3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S39C3" edc:desc="" edc:mask="0x1" edc:name="S39C3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG32COM3" edc:desc="" edc:mask="0x1" edc:name="SEG32COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG33COM3" edc:desc="" edc:mask="0x1" edc:name="SEG33COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG34COM3" edc:desc="" edc:mask="0x1" edc:name="SEG34COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG35COM3" edc:desc="" edc:mask="0x1" edc:name="SEG35COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG36COM3" edc:desc="" edc:mask="0x1" edc:name="SEG36COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG37COM3" edc:desc="" edc:mask="0x1" edc:name="SEG37COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG38COM3" edc:desc="" edc:mask="0x1" edc:name="SEG38COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG39COM3" edc:desc="" edc:mask="0x1" edc:name="SEG39COM3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA23" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA23" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA23" edc:desc="" edc:mask="0xff" edc:name="LCDDATA23" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S40C3" edc:desc="" edc:mask="0x1" edc:name="S40C3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S41C3" edc:desc="" edc:mask="0x1" edc:name="S41C3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S42C3" edc:desc="" edc:mask="0x1" edc:name="S42C3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S43C3" edc:desc="" edc:mask="0x1" edc:name="S43C3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S44C3" edc:desc="" edc:mask="0x1" edc:name="S44C3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S45C3" edc:desc="" edc:mask="0x1" edc:name="S45C3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S46C3" edc:desc="" edc:mask="0x1" edc:name="S46C3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S47C3" edc:desc="" edc:mask="0x1" edc:name="S47C3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG40COM3" edc:desc="" edc:mask="0x1" edc:name="SEG40COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG41COM3" edc:desc="" edc:mask="0x1" edc:name="SEG41COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG42COM3" edc:desc="" edc:mask="0x1" edc:name="SEG42COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG43COM3" edc:desc="" edc:mask="0x1" edc:name="SEG43COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG44COM3" edc:desc="" edc:mask="0x1" edc:name="SEG44COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG45COM3" edc:desc="" edc:mask="0x1" edc:name="SEG45COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG46COM3" edc:desc="" edc:mask="0x1" edc:name="SEG46COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG47COM3" edc:desc="" edc:mask="0x1" edc:name="SEG47COM3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nrnnn-nn" edc:cname="BAUDCON1" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="01000-00" edc:name="BAUDCON1" edc:nzwidth="0x8" edc:por="01000-00">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="BAUDCTL1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ABDEN" edc:desc="" edc:mask="0x1" edc:name="ABDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WUE" edc:desc="" edc:mask="0x1" edc:name="WUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BRG16" edc:desc="" edc:mask="0x1" edc:name="BRG16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCKP" edc:desc="" edc:mask="0x1" edc:name="SCKP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RCIDL" edc:desc="" edc:mask="0x1" edc:name="RCIDL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABDOVF" edc:desc="" edc:mask="0x1" edc:name="ABDOVF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="RCMT" edc:desc="" edc:mask="0x1" edc:name="RCMT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
